## Patch applications 
### ISM-1698

Requirement: A vulnerability scanner is used at least daily to identify missing patches or updates for vulnerabilities in online services.

**Title**
How to test: Pull timestamps for defender antivirus scans on a machine. maybe multiple machine

Template query below
```
DeviceInfo
| where TimeGenerated > ago(14d)
| where isnotempty( OSPlatform)
| summarize arg_max(TimeGenerated, *) by DeviceName
| project DeviceName, OSBuild, OSPlatform, OSVersion

```
