## Patch applications 
### ISM-1807

Requirement: An automated method of asset discovery is used at least fortnightly to support the detection of assets for subsequent vulnerability scanning activities.

## Confirm use of Microsoft Defender
```
DeviceInfo
| where TimeGenerated > ago(14d)
| where isnotempty( OSPlatform)
| summarize arg_max(TimeGenerated, *) by DeviceName
| project DeviceName, OSBuild, OSPlatform, OSVersion

```
