## Patch applications 
### ISM-1698

Requirement: A vulnerability scanner is used at least daily to identify missing patches or updates for vulnerabilities in online services.

[What is an online service?](https://www.cyber.gov.au/resources-business-and-government/essential-cybersecurity/essential-eight/essential-eight-maturity-model-faq)
- An online service is any service that is directly accessible over the internet, including those sitting behind a perimeter firewall. For example, a web portal, a cloud service or a network device (such as a firewall or VPN concentrator).
- An example of an online service that processes, stores or communicates an organisation’s sensitive data is any cloud service that has been authorised for use with OFFICIAL: Sensitive or PROTECTED data (such as GovTeams) or any other sensitive business data.
- Examples of online services that process, store or communicate an organisation’s non-sensitive data can include web hosting services (such as GovCMS) or social media platforms (such as Facebook, Instagram, LinkedIn, YouTube and X).

**Title**  
How to test: 
- Pull timestamps for defender antivirus scans on a machine. maybe multiple machine
- Look for social media apps and collaboration tools
- servers that are communicating over 80 or 443
- Pull timestamps for defender antivirus scans on each server that is communicating over 80 or 443
- 

Template query below
```
DeviceInfo
| where TimeGenerated > ago(14d)
| where isnotempty( OSPlatform)
| summarize arg_max(TimeGenerated, *) by DeviceName
| project DeviceName, OSBuild, OSPlatform, OSVersion

```
